In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('annual_csv.csv')

In [127]:
df

       Date     Price
0   1950-12    34.720
1   1951-12    34.660
2   1952-12    34.790
3   1953-12    34.850
4   1954-12    35.040
..      ...       ...
65  2015-12  1068.317
66  2016-12  1152.165
67  2017-12  1265.674
68  2018-12  1249.887
69  2019-12  1480.025

[70 rows x 2 columns]

In [ ]:
pd.

In [ ]:
df.plot()

In [ ]:
df

# Add prefix & suffix

In [ ]:
df.add_prefix('x_').add_suffix('_y')

# Reverse the row order of a dataframe

In [ ]:
df.head()

In [ ]:
df = df.loc[::-1].reset_index(drop=True)
df.head()

# Extract a series & create a new dataframe

In [ ]:
test_df = pd.DataFrame(df.Date)
test_df

# Reverse the columns order

In [ ]:
df = df.loc[:,::-1]

In [ ]:
df

# Read from clipboard

In [ ]:
df2 = pd.read_clipboard()
df2

# Extract columns by datatypes

In [ ]:
df.dtypes

In [ ]:
df.select_dtypes(include='float').head()

In [ ]:
df.select_dtypes(['number','object'],'').head()

In [ ]:
df.select_dtypes(exclude='number').head()

# convert strings to numbers

In [246]:

df2 = pd.DataFrame(data = {'col_one':['1','2','3','4'],
                    'col_two':['5','6','7','8'],
                    'col_three':['9','10','11','12']})

In [247]:
df2

  col_one col_two col_three
0       1       5         9
1       2       6        10
2       3       7        11
3       4       8        12

In [248]:
df2.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [249]:
df2.col_three = pd.to_numeric(df2.col_three)

In [250]:
df2 = df2.astype({'col_one':'int','col_two':'float'})

In [251]:
df2.col_three.astype(int)

0     9
1    10
2    11
3    12
Name: col_three, dtype: int32

In [252]:
df2.loc[3,'col_three'] = '-'

In [253]:
df2

   col_one  col_two col_three
0        1      5.0         9
1        2      6.0        10
2        3      7.0        11
3        4      8.0         -

In [254]:
df2.dtypes

col_one        int32
col_two      float64
col_three     object
dtype: object

In [255]:
df2

   col_one  col_two col_three
0        1      5.0         9
1        2      6.0        10
2        3      7.0        11
3        4      8.0         -

In [256]:
df2 = df2.apply(pd.to_numeric, errors='coerce')

In [257]:
df2

   col_one  col_two  col_three
0        1      5.0        9.0
1        2      6.0       10.0
2        3      7.0       11.0
3        4      8.0        NaN

# Save memory when reading csv files

In [189]:
df = pd.read_csv('annual_csv.csv', usecols=['Price'], dtype={'Price':'object'})

In [190]:
df.head()

    Price
0  34.720
1  34.660
2  34.790
3  34.850
4  35.040

In [196]:
df = pd.read_csv('annual_csv.csv')

In [197]:
df.dtypes

Date      object
Price    float64
dtype: object

In [198]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    70 non-null     object
 1   Price   70 non-null     float64
dtypes: float64(1), object(1)
memory usage: 5.0 KB

## Extract three values that occures maximum time

In [245]:
counts = df.Price.value_counts()
list(counts.nlargest(3).index)

[35.08, 34.72, 407.674]

## Handle Nan values

In [258]:
df2

   col_one  col_two  col_three
0        1      5.0        9.0
1        2      6.0       10.0
2        3      7.0       11.0
3        4      8.0        NaN

In [260]:
df2.fillna(0)

   col_one  col_two  col_three
0        1      5.0        9.0
1        2      6.0       10.0
2        3      7.0       11.0
3        4      8.0        0.0

In [261]:
df2

   col_one  col_two  col_three
0        1      5.0        9.0
1        2      6.0       10.0
2        3      7.0       11.0
3        4      8.0        NaN